@justinretzolk, here is our plan that prompts the error:
`
# aws_lambda_function.router will be updated in-place
  ~ resource "aws_lambda_function" "router" {
        id                             = "product-us-east-2-router"
      ~ last_modified                  = "2023-02-24T16:12:46.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:accountID:function:product-us-east-2-router:8" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:accountID:function:product-us-east-2-router:8/invocations" -> (known after apply)
      + skip_destroy                   = false
      ~ source_code_hash               = "hash" -> (known after apply)
        tags                           = {}
      ~ version                        = "8" -> (known after apply)
        # (16 unchanged attributes hidden)
        # (2 unchanged blocks hidden)
    }
`
Slightly redacted some values, but beyond code hash changes it's mostly wanting to add skip_destroy which prompts the issue.

Then the eventual error:
`
│ Error: Provider produced inconsistent final plan
│ 
│ When expanding the plan for aws_lambda_function.router to include new
│ values learned so far during apply, provider
│ "registry.terraform.io/hashicorp/aws" produced an invalid new value for
│ .skip_destroy: was cty.False, but now null.
│ 
│ This is a bug in the provider, which should be reported in the provider's
│ own issue tracker.
`

Versions:
`
Provider: hashicorp/aws v4.57.0
TERRAFORM='1.3.5'
TERRAGRUNT='v0.40.2'
`